{
  "technicalEvents": [
    {
      "id": "tech-1",
      "title": "Paper Presentation",
      "image": "/events/tech/paper-present.png",
      "description": "Showcase your research and technical knowledge through a formal paper presentation. Present innovative ideas and solutions to technical challenges in this competitive academic forum.",
      "rules": [
        "The participants could be solo, a team of two or three.",
        "Participant must submit abstract of their paper during the registration process on or before 14th April 2025.",
        "Papers will be shortlisted based on the quality, relevance and originality of the abstract.",
        "Author of the shortlisted paper will be notified of acceptance via mail before 16th April 2025.",
        "Accepted authors will receive instructions on how to proceed with full paper submission. Registration and payment must be completed on or before 20th April 2025.",
        "Author of accepted paper are asked to be ready with oral PowerPoint presentation for 7 to 10 min which will be the on-stage event.",
        "Winning contestant will be rewarded by the attractive cash prizes."
      ],
      "coordinator1": {
        "name": "Kutraleeswaran S",
        "phone": "7010438138"
      },
      "coordinator2": {
        "name": "Dhayanithi S",
        "phone": "9344347148"
      },
      "time": "10:30 AM",
      "venue": "Main Auditorium",
      "submission_name": "Abstract Submission Email",
      "submission_Email": "kutraleeswar2k2@gmail.com"
    },
    {
      "id": "tech-2",
      "title": "Project Presentation",
      "image": "/events/tech/project-present.png",
      "description": "Demonstrate your engineering skills by presenting a working project or prototype. Explain your design process, implementation challenges, and results in this showcase of technical innovation.",
      "rules": [
        "The participants could be solo, a team of two or three.",
        "The participants must upload their project abstract, along with the existing system, proposed solutions with methodology, and scope, with a maximum of 5 pages as a soft copy during registration.",
        "The participants must bring their working project model and presentation slides.",
        "Presentation will approximately take 5-10 minutes per team, followed by a live demonstration of the project.",
        "The participants must provide their project report (hard copy).",
        "Batches will be allocated based on registration. The last date to send the abstract is 14th April 2025, and you will receive the shortlists on 16th April 2025 via mail.",
        "The winners will be determined by juries.",
        "Contestants who violate the rules and guidelines will be eliminated instantly."
      ],
      "coordinator1": {
        "name": "Sathasivam C",
        "phone": "9080687054"
      },
      "coordinator2": {
        "name": "Kavikumar B",
        "phone": "8870822957"
      },
      "time": "10:30 AM",
      "venue": "IT Computer Lab 1",
      "submission_name": "Abstract Submission Email",
      "submission_Email": "smsathasivam93@gmail.com"
    }
  ],
  "technicalIndividualEvents": [
    {
      "id": "tech-ind-1",
      "title": "Code Debugging",
      "image": "/events/tech/code-debug.png",
      "description": "Test your problem-solving skills by identifying and fixing bugs in provided code snippets. Race against time to debug and optimize problematic code in various programming languages.",
      "rules": [
        "Individual participation only.",
        "Code debugging event with provided code.",
        "Preferred languages: C/Java.",
        "\"Pen and paper\" event, usage of the internet and any other electronic devices is prohibited.",
        "\"Two rounds\", 30 minutes each, no extra time.",
        "Batches allocated based on registration.",
        "Prize for first successful debugging or best debugging outcome.",
        "Violations result in instant disqualification.",
        "Misbehavior with volunteers leads to disqualification."
      ],
      "coordinator1": {
        "name": "Rashika R",
        "phone": "9080687054"
      },
      "coordinator2": {
        "name": "Sowmiya S K",
        "phone": "7708431780"
      },
      "time": "11:00 AM",
      "venue": "IT Computer Lab 2",
      "registrationLink": "https://example.com/register/aiml"
    },
    {
      "id": "tech-ind-2",
      "title": "Blind Coding",
      "image": "/events/tech/blind-coding.png",
      "description": "A challenging coding competition where participants get only one chance to execute their program correctly, testing their ability to write error-free code without immediate feedback. This unique format evaluates programming accuracy and problem-solving skills under time pressure.",
      "rules": {
        "round1": {
          "title": "Round 1 : 15 mins",
          "rules": [
            "Participants will be given a simple problem statement with input and output requirements.",
            "Programming languages: C, Python, Java.",
            "They must type the code in their preferred programming language.",
            "The program must be run only once, with proctoring by volunteers.",
            "Any errors faced during the first attempt at running the program lead to elimination.",
            "The participant to successfully run the program (based on time) or provide the best output will be shortlisted for the second round."
          ]
        },
        "round2": {
          "title": "Round 2 : 15 mins",
          "rules": [
            "The difficulty level of the question will be set to medium.",
            "Any errors faced during the first attempt at running the program lead to elimination.",
            "The first participant to successfully run the program (based on time) or provide the best output will be declared the winner of the contest."
          ]
        }
      },
      "coordinator1": {
        "name": "Rethanya S",
        "phone": "7010438138"
      },
      "coordinator2": {
        "name": "Rasiga M",
        "phone": "9345128184"
      },
      "time": "11:00 AM",
      "venue": "IT Computer Lab 3",
      "registrationLink": "https://example.com/register/aiml"
    },
    {
      "id": "tech-ind-3",
      "title": "Tech Quiz",
      "image": "/events/tech/tech-quiz.png",
      "description": "Test your knowledge of technology, computer science, engineering concepts, and current tech trends in this fast-paced quiz competition. Demonstrate your technical expertise across diverse domains.",
      "rules": [
        "Individual participation as already mentioned.",
        "Online quiz based on programming languages (C, Python, Java) and SQL logic, DSA (Data Structures & Algorithms).",
        "Conducted via an online platform in the auditorium [proctored].",
        "Section A [Easy], Section B [Medium], Section C [Hard].",
        "Questions cover topics in specified programming languages and SQL logic.",
        "Time limit for completing the quiz.",
        "Rules regarding cheating, plagiarism, and code of conduct will be strictly enforced.",
        "Submission of responses within the specified time frame.",
        "Each question may have multiple-choice, true/false, or short answer format.",
        "Scores will be calculated automatically by the platform.",
        "Only legitimate attempts will be considered for scoring.",
        "Violation of rules results in disqualification."
      ],
      "coordinator1": {
        "name": "Harish R",
        "phone": "6374130384"
      },
      "coordinator2": {
        "name": "Sanuktha A",
        "phone": "9361334075"
      },
      "time": "12:20 PM",
      "venue": "Main Auditorium",
      "registrationLink": "https://example.com/register/aiml"
    },
    {
      "id": "tech-ind-4",
      "title": "Hunt Mods",
      "image": "/events/tech/hunt-mods.png",
      "description": "Embark on a technical treasure hunt that combines problem-solving, cryptography, and coding skills. Navigate through a series of technical puzzles and challenges to reach the final goal.",
      "rules": {
        "round1": {
          "title": "Round 1 : 30 mins",
          "rules": [
            "Individual participation only.",
            "The code has a logical error in it, the participants need to alter the logic and provide the output mentioned.",
            "Preferred programming language: C, Python, Java.",
            "The program must be run only once, with proctoring by volunteers.",
            "Participants can run the code 'N' times within the allocated time.",
            "The participant to successfully run the program (based on time) or provide the best output will be shortlisted for the second round."
          ]
        },
        "round2": {
          "title": "Round 2 : 30 mins",
          "rules": [
            "The difficulty level of the question will be set to medium.",
            "Participants can run the code 'N' times within the allocated time.",
            "Time is everything for the event, no extended time for participants.",
            "The participant to successfully run the program (based on time) or provide the best output will be declared the winner of the contest."
          ]
        }
      },
      "coordinator1": {
        "name": "Ramesh M",
        "phone": "7904997763"
      },
      "coordinator2": {
        "name": "Ganga B",
        "phone": "8072017045"
      },
      "time": "12:20 PM",
      "venue": "IT Computer Lab 2",
      "registrationLink": "https://example.com/register/aiml"
    }
  ],
  "nonTechnicalEvents": [
    {
      "id": "non-tech-1",
      "title": "Meme Contest",
      "image": "/events/non-tech/meme-contest.png",
      "description": "Showcase your creativity and humor by creating original memes based on given themes. Express your wit and design skills in this light-hearted yet competitive event.",
      "rules": [
        "Online Event",
        "Register within the specified date to participate.",
        "Only individual participation is permitted; no group entries.",
        "Memes must be created only based on provided situations.",
        "Created memes must be uploaded online before the deadline via meme submission email.",
        "Winners will receive exciting prizes as rewards."
      ],
      "coordinator1": {
        "name": "Dhinesh A",
        "phone": "9361197215"
      },
      "coordinator2": {
        "name": "Devak C K",
        "phone": "9047021100"
      },
      "time": "Online Event",
      "submission_name": "Meme Submission Email",
      "submission_Email": "adhineshinfotech10@gmail.com"
    },
    {
      "id": "non-tech-2",
      "title": "Photography",
      "image": "/events/non-tech/photography.png",
      "description": "Capture the essence of the given theme through your camera lens. Demonstrate your photography skills, artistic vision, and ability to tell a story through images.",
      "rules": [
        "Online Event",
        "Participants must work alone; no group submissions permitted.",
        "A specified theme will guide participants in creating their photo.",
        "Only touch editing is permitted, with plagiarism leading to disqualification.",
        "Photos must be uploaded online before the deadline via photo submission email.",
        "Winners will be notified and rewarded with prizes."
      ],
      "coordinator1": {
        "name": "Sanjay M",
        "phone": "6380266425"
      },
      "coordinator2": {
        "name": "Sabeshragav G K",
        "phone": "9080033226"
      },
      "time": "Online Event",
      "submission_name": "Photography Submission Email",
      "submission_Email": "sanjaysanju212004@gmail.com"
    }
  ]
}
